---
type: PointOnFace
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# PointOnFace

`Autodesk.Revit.DB.PointOnFace` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetFaceReference | — | `public Reference GetFaceReference ()` |
| Method | SetFaceReference | — | `public void SetFaceReference ( Reference reference )` |
| Property | UV | — | `public UV UV { get ; set ; }` |